; domain
(define (domain healthcare_facility_2_base)
    (:requirements :strips :typing :equality)

    (:types
        location carrier - object
        worker_bot helper_bot - robot
        med_unit robot box supply patient - locatable
    )

    (:predicates
        ; location related
        (at ?obj - locatable ?loc - location) ; locatable is at a location
        (linked ?loc1 - location ?loc2 - location) ; two locations are linked (roadmap)
        
        ; General Robot related
        (bot_is_free ?bot - robot) ; bot is free (not carrying a box or helping a patient)
        
        ; Worker bots
        (bot_owns_carrier ?bot - robot ?carr - carrier) ; a bot owns a carrier
        
        ; Helper bots
        (helping_patient ?bot - helper_bot ?pat - patient) ; helper bot is helping the patient

        ; Carrier related
        (carrying_box ?carr - carrier ?obj - box) ; carrier has the box loaded
        (carrier_can_1 ?carr - carrier)  ; carrier can hold box 1
        (carrier_can_2 ?carr - carrier)   ; carrier can hold box 2   
        (carrier_can_3 ?carr - carrier)  ; carrier can hold box 3 (maximum)
        ; Carrier capacity settings
        (carrier_empty ?carr - carrier) ; carrier has 0 boxes
        (carrier_has_1 ?carr - carrier); carrier has 1 box
        (carrier_has_2 ?carr - carrier) ; carrier has 2 boxes
        (carrier_has_3 ?carr - carrier) ; carrier has 3 boxes (maximum)
        
        ; Box related
        (box_is_empty ?box - box) ; box is empty
        (box_on_ground ?box - box) ; box is on the ground (not being carried by a bot)

        ; Patient related
        (patient_on_ground ?pat - patient) ; patient is on the ground (not being helped)

        ; Supply related
        (supply_in_box ?sup - supply ?box - box) ; supply is in a box
        
        ; Goal Oriented
        (needs_supply ?mu - med_unit ?sup - supply) ; medical unit needs a supply
        (needs_patient ?mu - med_unit ?pat - patient) ; medical unit needs a patient so he they can treat them
        (has_supply ?mu - med_unit ?sup - supply) ; medical unit has a supply
        (has_patient ?mu - med_unit ?pat - patient) ; medical unit has a patient
    )

    ;;
    ;; Move Actions
    ;;
    
    (:action move_bot_alone
        :parameters (?bot - robot ?from - location ?to - location)
        :precondition (and
            ; location consistency
            (at ?bot ?from)
            (linked ?from ?to)
            ; the bot is free (carrier is empty / not helping a patient)
            (bot_is_free ?bot)
        )
        :effect (and
            ; change location (bot)
            (not (at ?bot ?from))
            (at ?bot ?to)
        )
    )
    
    (:action move_worker_bot_with_1_box
        :parameters (?bot - worker_bot ?carr - carrier ?box - box ?from - location ?to - location)
        :precondition (and
            ; location consistency
            (at ?bot ?from)
            (linked ?from ?to)
            ; carrier checks
            (bot_owns_carrier ?bot ?carr)
            (carrier_has_1 ?carr) ; the bot carries a single box
            (carrying_box ?carr ?box) ; carrying one box
        )
        :effect (and
            ; update location (bot)
            (not (at ?bot ?from))
            (at ?bot ?to)
            ; update location (box)
            (not (at ?box ?from))
            (at ?box ?to)
        )
    )
    
    (:action move_worker_bot_with_2_boxes
        :parameters (?bot - worker_bot ?carr - carrier ?box1 - box ?box2 - box ?from - location ?to - location)
        :precondition (and
            ; location consistency
            (at ?bot ?from)
            (linked ?from ?to)
            ; carrier is owned by the bot and has capacity for 2 boxes
            (bot_owns_carrier ?bot ?carr)
            (carrier_has_2 ?carr)
            ; both boxes are on the carrier
            (carrying_box ?carr ?box1)
            (carrying_box ?carr ?box2)
            ; boxes must be different
            (not (= ?box1 ?box2))
        )
        :effect (and
            ; update location (bot)
            (not (at ?bot ?from))
            (at ?bot ?to)
            ; update location of both boxes
            (not (at ?box1 ?from))
            (at ?box1 ?to)
            (not (at ?box2 ?from))
            (at ?box2 ?to)
        )
    )

    (:action move_worker_bot_with_3_boxes
        :parameters (?bot - worker_bot ?carr - carrier ?box1 - box ?box2 - box  ?box3 - box  ?from - location ?to - location)
        :precondition (and
            ; location consistency
            (at ?bot ?from)
            (linked ?from ?to)
            ; carrier is owned by the bot and has capacity for 3 boxes
            (bot_owns_carrier ?bot ?carr)
            (carrier_has_3 ?carr)
            ; all three boxes are on the carrier
            (carrying_box ?carr ?box1)
            (carrying_box ?carr ?box2)
            (carrying_box ?carr ?box3)
            ; boxes must be different
            (not (= ?box1 ?box2))
            (not (= ?box1 ?box3))
            (not (= ?box2 ?box3))
        )
        :effect (and
            ; update location (bot)
            (not (at ?bot ?from))
            (at ?bot ?to)
            ; update location of all three boxes
            (not (at ?box1 ?from))
            (at ?box1 ?to)
            (not (at ?box2 ?from))
            (at ?box2 ?to)
            (not (at ?box3 ?from))
            (at ?box3 ?to)
        )
    )

    (:action move_helper_bot_patient
        :parameters (?bot - helper_bot ?from - location ?to - location ?pat - patient)
        :precondition (and
            ; location consistency
            (at ?bot ?from)
            (linked ?from ?to)
            ; helper bot is helping a patient
            (helping_patient ?bot ?pat)
        )
        :effect (and
            ; update location (bot)
            (not (at ?bot ?from))
            (at ?bot ?to)
            ; update location (patient)
            (not (at ?pat ?from))
            (at ?pat ?to)
        )
    )
    

    ;;
    ;; Worker Bots : These are the bots that carry boxes with supplies  
    ;;

    ; pick up first box when carrier is empty (0 -> 1)
    (:action pick_up_1st_box
        :parameters (?bot - worker_bot ?carr - carrier ?box - box ?loc - location)
        :precondition (and
            ; location consistency
            (at ?bot ?loc)
            (at ?box ?loc)
            ; box not being carried
            (box_on_ground ?box)
            ; carrier has space
            (bot_owns_carrier ?bot ?carr)
            (carrier_empty ?carr)
            (carrier_can_1 ?carr)
        )
        :effect (and
            ; robot now has the box
            (carrying_box ?carr ?box)
            (not (box_on_ground ?box))
            ; update carrier capacity
            (not (carrier_empty ?carr))
            (carrier_has_1 ?carr)
            ; bot becomes busy
            (not (bot_is_free ?bot))
        )
    )

    ; pick up second box when carrier has one (1 -> 2)
    (:action pick_up_2nd_box
        :parameters (?bot - worker_bot ?carr - carrier ?box - box ?loc - location)
        :precondition (and
            ; location consistency
            (at ?bot ?loc)
            (at ?box ?loc)
            ; box not being carried
            (box_on_ground ?box)
            ; carrier has space
            (bot_owns_carrier ?bot ?carr)
            (carrier_has_1 ?carr) ; one box is already being carried
            (carrier_can_2 ?carr) ; carrier must have capacity for 2 boxes
        )
        :effect (and
            ; robot now has the box
            (carrying_box ?carr ?box)
            (not (box_on_ground ?box))
            ; update carrier capacity
            (not (carrier_has_1 ?carr))
            (carrier_has_2 ?carr)
        )
    )

    ; pick up third box when carrier has two (2 -> 3)
    (:action pick_up_3rd_box
        :parameters (?bot - worker_bot ?carr - carrier ?box - box ?loc - location)
        :precondition (and
            ; location consistency
            (at ?bot ?loc)
            (at ?box ?loc)
            ; box not being carried
            (box_on_ground ?box)
            ; carrier has space
            (bot_owns_carrier ?bot ?carr)
            (carrier_has_2 ?carr) ; two boxes are already being carried
            (carrier_can_3 ?carr) ; carrier must have capacity for 3 boxes
        )
        :effect (and
            ; robot now has the box
            (carrying_box ?carr ?box)
            (not (box_on_ground ?box))
            ; update carrier capacity
            (not (carrier_has_2 ?carr))
            (carrier_has_3 ?carr)
        )
    )

    ; drop down a box when carrier is full (3 -> 2)
    (:action drop_down_3rd_box
        :parameters (?bot - worker_bot ?carr - carrier ?box - box)
        :precondition (and
            ; the bot carries the box
            (carrying_box ?carr ?box)
            ; bot owns the carrier
            (bot_owns_carrier ?bot ?carr)
            (carrier_has_3 ?carr) ; carrier has 3 boxes on (maximum capacity)
        )
        :effect (and
            ; leave box there
            (not (carrying_box ?carr ?box))
            (box_on_ground ?box)
            ; update carrier capacity
            (not (carrier_has_3 ?carr))
            (carrier_has_2 ?carr)
        )
    )

    ; drop down a box when carrier has two boxes (2 -> 1)
    (:action drop_down_2nd_box
        :parameters (?bot - worker_bot ?carr - carrier ?box - box)
        :precondition (and
            ; the bot carries the box
            (carrying_box ?carr ?box)
            ; bot owns the carrier
            (bot_owns_carrier ?bot ?carr)
            (carrier_has_2 ?carr) ; carrier has 2 boxes on
        )
        :effect (and
            ; leave box there
            (not (carrying_box ?carr ?box))
            (box_on_ground ?box)
            ; update carrier capacity
            (not (carrier_has_2 ?carr))
            (carrier_has_1 ?carr)
        )
    )

    ; drop down a box when carrier has 1 boxes (1 -> 0)
    (:action drop_down_1st_box
        :parameters (?bot - worker_bot ?carr - carrier ?box - box)
        :precondition (and
            ; the bot carries the box
            (carrying_box ?carr ?box)
            ; bot owns the carrier
            (bot_owns_carrier ?bot ?carr)
            (carrier_has_1 ?carr)
        )
        :effect (and
            ; leave box there
            (not (carrying_box ?carr ?box))
            (box_on_ground ?box)
            ; update carrier capacity
            (not (carrier_has_1 ?carr))
            (carrier_empty ?carr) ; carrier is now empty
            ; robot is once again free
            (bot_is_free ?bot)
        )
    )


    (:action fill_box
        :parameters (?bot - worker_bot ?box - box ?sup - supply ?loc - location)
        :precondition (and
            ; location consistency
            (at ?bot ?loc)
            (at ?sup ?loc)
            (at ?box ?loc)
            ; the box is not being carried
            (box_on_ground ?box)
            ; box must be empty
            (box_is_empty ?box)
        )
        :effect (and
            ; fill the box with the supply
            (supply_in_box ?sup ?box)
            (not (box_is_empty ?box))
        )
    )


    (:action deliver_supply
        :parameters (?bot - worker_bot ?box - box ?sup - supply ?loc - location ?mu - med_unit)
        :precondition (and
            ; location consistency
            (at ?bot ?loc)
            (at ?mu ?loc)
            (at ?box ?loc)
            ; the box is NOT being carried
            (box_on_ground ?box)
            ; the supply is in the box
            (supply_in_box ?sup ?box)
            ; the medical unit needs such supply
            (needs_supply ?mu ?sup)
        )
        :effect (and
            ; empty the box
            (not (supply_in_box ?sup ?box))
            (box_is_empty ?box)
            ; satisfy the medical unit's need and hand over the supply
            (not (needs_supply ?mu ?sup)) 
            (has_supply ?mu ?sup)
        )
    )

    ;;
    ;; Helper Bots : These are the bots that accompany patients to medical units
    ;;

    (:action pick_up_patient
        :parameters (?bot - helper_bot ?pat - patient ?loc - location)
        :precondition (and
            ; location consistency
            (at ?bot ?loc)
            (at ?pat ?loc)
            ; patient is not being helped by some other bot
            (patient_on_ground ?pat)
            ; helper bot is free
            (bot_is_free ?bot)
        )
        :effect (and
            ; helper bot accompanies the patient
            (helping_patient ?bot ?pat)
            (not (patient_on_ground ?pat))
            ; helper bot is now busy
            (not (bot_is_free ?bot))
        )
    )
    (:action drop_down_patient
        :parameters (?bot - helper_bot ?pat - patient)
        :precondition (and
            ; helper bot accompanies the patient
            (helping_patient ?bot ?pat)
        )
        :effect (and
            ; helper bot no longer accompanies the patient
            (not (helping_patient ?bot ?pat))
            (patient_on_ground ?pat)
            ; helper bot is no longer busy
            (bot_is_free ?bot)
        )
    )
    (:action deliver_patient
        :parameters (?bot - helper_bot ?pat - patient ?mu - med_unit ?loc - location)
        :precondition (and
            ; location consistency
            (at ?bot ?loc)
            (at ?mu ?loc)
            (at ?pat ?loc)
            ; the patient is not being helped by some other bot
            (patient_on_ground ?pat) 
            ; the patient needs treatment at the medical unit
            (needs_patient ?mu ?pat)
        )
        :effect (and
            ; satisfy the medical unit's need for the patient and hand over the patient
            (not (needs_patient ?mu ?pat))
            (has_patient ?mu ?pat)
        )
    )
)

; problem
(define (problem healthcare_facility_2_base_simple)
    (:domain healthcare_facility_2_base)

    (:objects 
        ;; Locations
        entrance reception diagnostic_lab corridor1 corridor2 central_warehouse
        surgical_block emergency_room cardiology_ward neurology_ward
        - location

        ;; Robots
        wBot1 - worker_bot
        hBot1 - helper_bot

        ;; Carrier (new in this domain)
        carrier1 - carrier

        ;; Boxes
        box1 box2 - box

        ;; Supplies
        scalpel defibrillator - supply

        ;; Medical Units
        trauma_unit resuscitation_unit triage_unit operation_unit cardiology_unit neurology_unit - med_unit

        ;; Patients
        patient1 - patient
    )

    (:init
        ;; Roadmap
        (linked entrance reception)
        (linked reception entrance)

        (linked reception emergency_room)
        (linked emergency_room reception)

        (linked emergency_room corridor2)
        (linked corridor2 emergency_room)

        (linked corridor2 diagnostic_lab)
        (linked diagnostic_lab corridor2)

        (linked corridor1 diagnostic_lab)
        (linked diagnostic_lab corridor1)
        
        (linked surgical_block corridor1)
        (linked corridor1 surgical_block)

        (linked corridor1 central_warehouse)
        (linked central_warehouse corridor1)

        (linked reception corridor1)
        (linked corridor1 reception)

        (linked diagnostic_lab neurology_ward)
        (linked neurology_ward diagnostic_lab)

        (linked surgical_block cardiology_ward)
        (linked cardiology_ward surgical_block)

        ;; Carrier setup
        (bot_owns_carrier wBot1 carrier1)
        (carrier_empty carrier1)
        (carrier_can_1 carrier1) (carrier_can_2 carrier1) (carrier_can_3 carrier1) ; Carrier has 3 slots for boxes

        ;; Medical unit locations
        (at trauma_unit emergency_room)
        (at resuscitation_unit emergency_room)
        (at triage_unit reception)
        (at operation_unit surgical_block)
        (at cardiology_unit cardiology_ward)
        (at neurology_unit neurology_ward)

        ;; Robots are free at their initial positions
        (at wBot1 central_warehouse)
        (at hBot1 entrance)
        
        ;; Bots are free
        (bot_is_free wBot1)
        (bot_is_free hBot1)

        ;; Boxes at central_warehouse
        (at box1 central_warehouse)
        (at box2 central_warehouse)
        
        ;; Boxes are empty
        (box_is_empty box1)
        (box_is_empty box2)

        ;; Boxes on the ground
        (box_on_ground box1)
        (box_on_ground box2)

        ;; Supplies at central_warehouse
        (at scalpel central_warehouse)
        (at defibrillator central_warehouse)

        ;; Patient at entrance, not being helped
        (at patient1 entrance) (patient_on_ground patient1)

        ;; Medical unit needs
        (needs_supply trauma_unit scalpel)
        (needs_supply resuscitation_unit defibrillator)
        (needs_patient operation_unit patient1)
    )

    (:goal
        (and
            ;; Satisfy all needs
            (has_supply trauma_unit scalpel)
            (has_supply resuscitation_unit defibrillator)
            
            ;; Satisfy patient need
            (has_patient operation_unit patient1)

            ;; bot return to starting conditions
            (at wBot1 central_warehouse)
            (at hBot1 entrance)
            (bot_is_free wBot1)
            (bot_is_free hBot1)

            ;; Carrier is empty
            (carrier_empty carrier1)

            ;; Return boxes (empty) to the central warehouse
            (at box1 central_warehouse)
            (at box2 central_warehouse)
            (box_is_empty box1)
            (box_is_empty box2)
            (box_on_ground box1)
            (box_on_ground box2)
        )
    )
)

; plan
1. (fill_box wbot1 box1 defibrillator central_warehouse)
   deleted: (box_is_empty box1)
   added: (supply_in_box defibrillator box1)
   goals met: 10 of 14
2. (fill_box wbot1 box2 scalpel central_warehouse)
   deleted: (box_is_empty box2)
   added: (supply_in_box scalpel box2)
   goals met: 9 of 14
3. (pick_up_1st_box wbot1 carrier1 box1 central_warehouse)
   deleted: (box_on_ground box1) (carrier_empty carrier1) (bot_is_free wbot1)
   added: (carrying_box carrier1 box1) (carrier_has_1 carrier1)
   goals met: 6 of 14
4. (pick_up_2nd_box wbot1 carrier1 box2 central_warehouse)
   deleted: (box_on_ground box2) (carrier_has_1 carrier1)
   added: (carrying_box carrier1 box2) (carrier_has_2 carrier1)
   goals met: 5 of 14
5. (move_worker_bot_with_2_boxes wbot1 carrier1 box1 box2 central_warehouse corridor1)
   deleted: (at wbot1 central_warehouse) (at box1 central_warehouse) (at box2 central_warehouse)
   added: (at wbot1 corridor1) (at box1 corridor1) (at box2 corridor1)
   goals met: 2 of 14
6. (move_worker_bot_with_2_boxes wbot1 carrier1 box1 box2 corridor1 reception)
   deleted: (at wbot1 corridor1) (at box1 corridor1) (at box2 corridor1)
   added: (at wbot1 reception) (at box1 reception) (at box2 reception)
   goals met: 2 of 14
7. (move_worker_bot_with_2_boxes wbot1 carrier1 box1 box2 reception emergency_room)
   deleted: (at wbot1 reception) (at box1 reception) (at box2 reception)
   added: (at wbot1 emergency_room) (at box1 emergency_room) (at box2 emergency_room)
   goals met: 2 of 14
8. (drop_down_2nd_box wbot1 carrier1 box1)
   deleted: (carrying_box carrier1 box1) (carrier_has_2 carrier1)
   added: (box_on_ground box1) (carrier_has_1 carrier1)
   goals met: 3 of 14
9. (drop_down_1st_box wbot1 carrier1 box2)
   deleted: (carrying_box carrier1 box2) (carrier_has_1 carrier1)
   added: (box_on_ground box2) (carrier_empty carrier1) (bot_is_free wbot1)
   goals met: 6 of 14
10. (pick_up_patient hbot1 patient1 entrance)
   deleted: (patient_on_ground patient1) (bot_is_free hbot1)
   added: (helping_patient hbot1 patient1)
   goals met: 5 of 14
11. (deliver_supply wbot1 box1 defibrillator emergency_room resuscitation_unit)
   deleted: (supply_in_box defibrillator box1) (needs_supply resuscitation_unit defibrillator)
   added: (box_is_empty box1) (has_supply resuscitation_unit defibrillator)
   goals met: 7 of 14
12. (deliver_supply wbot1 box2 scalpel emergency_room trauma_unit)
   deleted: (supply_in_box scalpel box2) (needs_supply trauma_unit scalpel)
   added: (box_is_empty box2) (has_supply trauma_unit scalpel)
   goals met: 9 of 14
13. (move_helper_bot_patient hbot1 entrance reception patient1)
   deleted: (at hbot1 entrance) (at patient1 entrance)
   added: (at hbot1 reception) (at patient1 reception)
   goals met: 8 of 14
14. (move_helper_bot_patient hbot1 reception corridor1 patient1)
   deleted: (at hbot1 reception) (at patient1 reception)
   added: (at hbot1 corridor1) (at patient1 corridor1)
   goals met: 8 of 14
15. (move_helper_bot_patient hbot1 corridor1 surgical_block patient1)
   deleted: (at hbot1 corridor1) (at patient1 corridor1)
   added: (at hbot1 surgical_block) (at patient1 surgical_block)
   goals met: 8 of 14
16. (drop_down_patient hbot1 patient1)
   deleted: (helping_patient hbot1 patient1)
   added: (patient_on_ground patient1) (bot_is_free hbot1)
   goals met: 9 of 14
17. (deliver_patient hbot1 patient1 operation_unit surgical_block)
   deleted: (needs_patient operation_unit patient1)
   added: (has_patient operation_unit patient1)
   goals met: 10 of 14
18. (move_bot_alone hbot1 surgical_block corridor1)
   deleted: (at hbot1 surgical_block)
   added: (at hbot1 corridor1)
   goals met: 10 of 14
19. (move_bot_alone hbot1 corridor1 reception)
   deleted: (at hbot1 corridor1)
   added: (at hbot1 reception)
   goals met: 10 of 14
20. (move_bot_alone hbot1 reception entrance)
   deleted: (at hbot1 reception)
   added: (at hbot1 entrance)
   goals met: 11 of 14
21. (pick_up_1st_box wbot1 carrier1 box1 emergency_room)
   deleted: (box_on_ground box1) (carrier_empty carrier1) (bot_is_free wbot1)
   added: (carrying_box carrier1 box1) (carrier_has_1 carrier1)
   goals met: 8 of 14
22. (pick_up_2nd_box wbot1 carrier1 box2 emergency_room)
   deleted: (box_on_ground box2) (carrier_has_1 carrier1)
   added: (carrying_box carrier1 box2) (carrier_has_2 carrier1)
   goals met: 7 of 14
23. (move_worker_bot_with_2_boxes wbot1 carrier1 box1 box2 emergency_room reception)
   deleted: (at wbot1 emergency_room) (at box1 emergency_room) (at box2 emergency_room)
   added: (at wbot1 reception) (at box1 reception) (at box2 reception)
   goals met: 7 of 14
24. (move_worker_bot_with_2_boxes wbot1 carrier1 box1 box2 reception corridor1)
   deleted: (at wbot1 reception) (at box1 reception) (at box2 reception)
   added: (at wbot1 corridor1) (at box1 corridor1) (at box2 corridor1)
   goals met: 7 of 14
25. (move_worker_bot_with_2_boxes wbot1 carrier1 box1 box2 corridor1 central_warehouse)
   deleted: (at wbot1 corridor1) (at box1 corridor1) (at box2 corridor1)
   added: (at wbot1 central_warehouse) (at box1 central_warehouse) (at box2 central_warehouse)
   goals met: 10 of 14
26. (drop_down_2nd_box wbot1 carrier1 box1)
   deleted: (carrying_box carrier1 box1) (carrier_has_2 carrier1)
   added: (box_on_ground box1) (carrier_has_1 carrier1)
   goals met: 11 of 14
27. (drop_down_1st_box wbot1 carrier1 box2)
   deleted: (carrying_box carrier1 box2) (carrier_has_1 carrier1)
   added: (box_on_ground box2) (carrier_empty carrier1) (bot_is_free wbot1)
   goals met: 14 of 14
